<template>
    <h3>田蕴章《每日一题每日一字》</h3>
    <h4>365集目录全
        <button type="button" @click="switchSingleList">{{ state.list_btn }}</button>
        <select v-model="state.single_show" @change="switchSingleShow" v-if="state.list_btn=='单字'">
            <option value="繁/全">繁/全</option>
            <option value="繁/异">繁/异</option>
            <option value="简/全">简/全</option>
            <option value="简/异">简/异</option>
            <option value="简/同">简/同</option>
        </select>
    </h4>
    <input type="text" v-model.trim="state.query" placeholder="请输入关键字" @keyup.enter="doSearch(state.query)">

    <button type="button" id="search" @click="doSearch(state.query)">搜索</button>
    <p class="alert" v-if="state.show_alert">未搜到匹配项</p>
    <p>{{ state.single_show }} 共{{ state.everyDay.length }}字</p>
    <ul id="list">
        <li :class="state.single_class" v-for="day in state.everyDay">{{ day }}</li>
    </ul>
</template>

<script setup>
import { reactive, nextTick } from 'vue';

document.title = `每日一题，每日一字`

const everyDayOrigin = [
    '001【永】永字八法',
    '002【火】火字与笔顺',
    '003【必】必字与书法书法的定义',
    '004【右】右字与书法－择笔',
    '005【有】有字与执笔',
    '006【无】无字与捻管',
    '007【飞】飞字与入门',
    '008【耳】耳字与入门',
    '009【之】偏锋与中锋',
    '010【乎】方笔与圆笔',
    '011【者】藏锋与露锋',
    '012【也】临帖主要方法',
    '013【哉】临帖三忌',
    '014【不】自述书法教学经验原题：先学古人还是今人',
    '015【方】自述书法爱好原题：欧体字笨拙怎么办',
    '016【为】楷行草之间的联系',
    '017【岂】书法研究生报考方式',
    '018【君】今人难以超越古人',
    '019【臣】师古而不泥古',
    '020【日】高科技与学习书法',
    '021【月】行草字形大小',
    '022【雨】书法界文化品位低',
    '023【竹】书法家的标准',
    '024【鱼】风格和面目',
    '025【马】字外功',
    '026【龙】今人与古人临帖',
    '027【风】书法协会 (一)',
    '028【鸟】书法协会 (二)',
    '029【山】评委 (一)',
    '030【心】评委 (二)',
    '031【其】书法评选过程',
    '032【虎】流行书风',
    '033【气】学院派书法',
    '034【良】正书展',
    '035【能】正书展评委',
    '036【而】投稿作弊',
    '037【处】学者型书法家',
    '038【门】异体字',
    '039【安】书法的变化',
    '040【孝】读书与书法关系',
    '041【自】当今书法家不写自己的诗',
    '042【高】现代书法',
    '043【武】个人书展',
    '044【每】书法有益于健康吗',
    '045【寿】雅俗共赏',
    '046【东】力透纸背',
    '047【西】硬笔书法与毛笔书法',
    '048【南】书法保守派',
    '049【北】字因人贵 (一)',
    '050【中】字因人贵 (二)',
    '051【多】少年儿童学书法',
    '052【世】书法天赋问题',
    '053【此】文人画与书法的关系',
    '054【曾】书法作品润格计算',
    '055【年】书法可以速成吗',
    '056【史】书法与笔迹学的关系',
    '057【事】书法作品个性形成原因',
    '058【是】繁体字与简体字不可相掺',
    '059【寺】酒与书法的关系',
    '060【言】书法是艺术吗 (一)',
    '061【登】书法是艺术吗 (二)',
    '062【知】什么是艺术书法',
    '063【家】书法水平与学历的关系',
    '064【寒】笔会话题',
    '065【云】“呼吁大师出现”话题',
    '066【当】书展评选话题',
    '067【笔】书法家和书法理论家的关系 (一)',
    '068【张】书法家和书法理论家的关系 (二)',
    '069【笑】书法家的诗词功力',
    '070【第】书品与人品的关系－颜真卿',
    '071【筑】书品与人品的关系－赵孟頫',
    '072【细】评电视书法大赛',
    '073【终】为什么敢于直面批评书协',
    '074【孙】什么是书法语言',
    '075【学】王羲之书法总体评价',
    '076【即】书法作品的错字',
    '077【部】魏碑为何被淘汰',
    '078【德】魏碑又得以复兴',
    '079【赋】论吴丈蜀',
    '080【泽】馆阁体',
    '081【难】诗对书法的影响',
    '082【道】词对书法的影响',
    '083【读】继承与创新',
    '084【观】郭沫若与“兰亭论辩” (一)兰亭序研究',
    '085【明】郭沫若与“兰亭论辩” (二)兰亭序研究',
    '086【爱】怎样欣赏李叔同书法',
    '087【得】论启功书法',
    '088【义】评文人墨迹',
    '089【独】论毛泽东书法',
    '090【桥】再谈错字问题',
    '091【头】论刘炳森书法',
    '092【集】论欧阳中石书法',
    '093【鬼】论日本书法',
    '094【故】丑书横行',
    '095【夜】媒体的误导',
    '096【疾】收藏今人书法作品危险性',
    '097【福】当代书法名人悲哀',
    '098【醉】书画与国剧的关系',
    '099【花】谈假字赝品的问题',
    '100【器】评田氏家族书法',
    '101【各】与网友探讨书艺',
    '102【青】我与中国书协的关系',
    '103【矣】写好名字是首要',
    '104【相】胡适的胸怀',
    '105【今】书展水平下降的原因',
    '106【思】学习古典书论',
    '107【于】关于书法术语的探讨',
    '108【台】宋四家书论有矛盾处',
    '109【憐】苏轼论书有相互矛盾之处',
    '110【流】欧阳修以书为乐',
    '111【交】可敬的女书家卫夫人',
    '112【国】可敬的女书家曹妙清',
    '113【乡】可敬的女书画家管道升 (一)',
    '114【亭】可敬的女书画家管道升 (二)',
    '115【物】现代女书家',
    '116【真】启功为我题写展标过程',
    '117【品】启功--书法界一代宗师',
    '118【冠】启功的多此一举',
    '119【衣】书林大隐余明善',
    '120【所】一面之交魏启后',
    '121【万】容易混淆的繁简字',
    '122【新】书法与美术有本质区别',
    '123【旧】书法家朴素中见高华',
    '124【野】父子书家',
    '125【如】书法教育应立法立项',
    '126【前】书法宗匠潘龄皋',
    '127【后】作假只为取笑不取利',
    '128【迅】再读国学与书法的关系',
    '129【滔】书法与西方美学的冲突',
    '130【岛】莫用小笔写大字',
    '131【琴】书法界山头林立',
    '132【然】当代国画家缺少什么',
    '133【竟】书展枪手无法防范',
    '134【华】阴柔与阳刚的对立统一',
    '135【兴】临帖是提高书法水平的重要手段',
    '136【定】难以沟通的审美差异',
    '137【我】海选的意义阳光书画展',
    '138【阳】写字与书法原题：难以沟通的审美差异',
    '139【出】范曾诗词与书法 (一)',
    '140【要】范曾诗词与书法 (二)',
    '141【宝】书法家审美的局限性',
    '142【善】颜真卿书法讨论',
    '143【恶】书家自身风格亦难统一自评书法风格',
    '144【书】展厅效应的弊端',
    '145【微】墨法质疑',
    '146【老】书谱精要讲解 (一)',
    '147【声】书谱精要讲解 (二)',
    '148【谷】书谱精要讲解 (三)',
    '149【差】书谱精要讲解 (四)',
    '150【章】书谱精要讲解 (五)',
    '151【添】书谱精要讲解 (六)',
    '152【州】书谱精要讲解 (七)',
    '153【掘】书谱精要讲解 (八)',
    '154【丽】书谱精要讲解 (九)',
    '155【非】书谱精要讲解 (十)',
    '156【启】书法家的道义',
    '157【劳】楷书的地位和意义',
    '158【皆】今人字帖良莠不齐',
    '159【激】傅山',
    '160【府】批评赝品引发争论',
    '161【岁】于右任其人其书',
    '162【将】于右任标准草书的意义',
    '163【区】以书展行骗五花八门',
    '164【桃】书画拍卖会骗局多多',
    '165【叔】书作文义内容杂谈',
    '166【態】谈书论法',
    '167【双】与朱家溍先生商榷九成宮版本商榷',
    '168【齐】书法创新刍议',
    '169【题】闲话心理障碍',
    '170【起】匠气匪气俗气',
    '171【初】王逸少为艺所掩（上）',
    '172【对】王逸少为艺所掩（下）',
    '173【春】书家争座位原题：浅谈书法作品文字内容出处',
    '174【夏】落款常识 (一)',
    '175【秋】落款常识 (二)',
    '176【敬】落款常识 (三)',
    '177【光】书法报刊应该百家争鸣',
    '178【若】孙伯翔书法',
    '179【以】一场选拔闹剧',
    '180【哀】书写楹联的常识',
    '181【会】皇甫君碑研究',
    '182【喜】多宝塔碑研究',
    '183【戏】麟游朝圣 (一)',
    '184【惊】麟游朝圣 (二)',
    '185【楼】碑林研讨会',
    '186【貌】草绝百韵歌',
    '187【恐】学习行书的方法',
    '188【驥】如何写好欧楷大字',
    '189【鄙】学习书法要保持低调',
    '190【成】自述攻书历程 (一)',
    '191【几】自述攻书历程 (二)',
    '192【殇】田氏二贤碑(一)',
    '193【黄】田氏二贤碑(二)',
    '194【翠】楷书作品演示',
    '195【许】行草作品演示',
    '196【典】草书作品演示',
    '197【写】灵飞经略谈',
    '198【宁】与沈尹默先生商榷悬肘之说',
    '199【动】沈尹默其人其书',
    '200【兼】自述学书与教书历程',
    '201【藏】书法家的判断标准',
    '202【上】窦娘子墓志考',
    '203【下】窦娘子墓志对欧书的警示',
    '204【确】欧阳询父亲是猿猴吗',
    '205【钱】行楷',
    '206【音】行草',
    '207【变】楷行草三下锅',
    '208【齿】板书的重要性',
    '209【汉】板书讲解与演示',
    '210【翁】如何学习集字圣教序(一)集字需要才能',
    '211【圣】如何学习集字圣教序(二)何谓读帖',
    '212【继】如何学习集字圣教序(三)技法问题',
    '213【念】柳公权其人其书',
    '214【昌】柳体书法特色',
    '215【归】历史书家名次排列的依据',
    '216【解】欧颜柳赵大同小异',
    '217【教】今楷是什么货色',
    '218【轻】旭宇与卢中南',
    '219【须】板书讲解与演示',
    '220【既】吴冠中的惊人之语',
    '221【族】拜师需要行大礼吗',
    '222【郎】榜书',
    '223【庐】小楷',
    '224【盈】春联(一)',
    '225【博】春联(二)',
    '226【觉】春联(三)',
    '227【徐】诗词入门(一)',
    '228【柳】诗词入门(二)',
    '229【虑】阳光书画展的得失',
    '230【阴】为什么总是自序',
    '231【草】王学仲误判葡萄作',
    '232【敢】刘艺错评减字联',
    '233【曺】人心思归',
    '234【切】碑帖中的警言妙句',
    '235【改】警言妙句《皇甫君碑》(一)',
    '236【紫】警言妙句《皇甫君碑》(二)',
    '237【色】警言妙句《皇甫君碑》(三)',
    '238【兆】简评九届国展',
    '239【建】书法协会的选举方式',
    '240【唐】国学大师与假洋鬼子_',
    '241【贵】书法研究生的专业考核',
    '242【作】书丹与刻石的关系',
    '243【尽】简评《广艺舟双楫》(一)',
    '244【饮】简评《广艺舟双楫》(二)',
    '245【弃】简评《广艺舟双楫》(三)',
    '246【职】简评《广艺舟双楫》(四)',
    '247【肃】简评《广艺舟双楫》(五)',
    '248【墨】简评《广艺舟双楫》(六)',
    '249【壶】简评《广艺舟双楫》(七)',
    '250【乐】简评《广艺舟双楫》(八)',
    '251【魄】简评《广艺舟双楫》(九)',
    '252【足】简评《广艺舟双楫》(十)',
    '253【满】碑帖结合论',
    '254【坟】欧阳询艺综南北',
    '255【审】论当代明星书法',
    '256【带】书法与简化字的关系(一)',
    '257【辰】书法与简化字的关系(二)',
    '258【祭】书论亦能误人(一)',
    '259【窗】书论亦能误人(二)',
    '260【神】书论亦能误人(三)',
    '261【承】大器免成',
    '262【天】书家应有谦虚态度',
    '263【断】韩国书艺申遗令我羞恼',
    '264【看】从铁凝写错字谈起',
    '265【居】钱钟书的自知之明',
    '266【常】闲话书奴',
    '267【四】手札在书法史的重要地位',
    '268【和】帝王书家_唐太宗',
    '269【鹏】帝王书家_宋徽宗',
    '270【孟】帝王书家_康熙与乾隆(一)',
    '271【繁】帝王书家_康熙与乾隆(二)',
    '272【民】启功性格与社会背景(一)',
    '273【佛】启功性格与社会背景(二)',
    '274【贤】“国展”法宝--会员证书',
    '275【尧】书法与“文革”_',
    '276【报】国展培训班的内幕',
    '277【众】书法个展少则精',
    '278【最】书法新名词使人困惑',
    '279【院】褚遂良其人其书(一)',
    '280【从】褚遂良其人其书(二)',
    '281【谢】褚遂良其人其书(三)',
    '282【希】记述年月的常识',
    '283【到】私塾与高校教育',
    '284【何】手札常识(一)',
    '285【空】手札常识(二)',
    '286【梦】漆书',
    '287【延】扬州八怪',
    '288【扁】浅谈郑板桥',
    '289【吾】书法家的烦恼(一)',
    '290【詹】书法家的烦恼(二)',
    '291【好】有职业书法家吗',
    '292【快】印泥颜色也讲究',
    '293【李】集字联与嵌名联(一)',
    '294【顿】集字联与嵌名联(二)',
    '295【坛】气韵与技法的统一性(一)',
    '296【急】气韵与技法的统一性(二)',
    '297【卫】闲话笔墨润格',
    '298【庆】书家的名字号',
    '299【幽】从京剧进入小学课题说起',
    '300【景】普及书法需要政令',
    '301【仑】单字与全篇的关系：楷书讲解',
    '302【密】单字与全篇的关系：楷书演示',
    '303【感】单字与全篇的关系：行草演示',
    '304【谓】神奇的伯远帖',
    '305【龟】再论苏黄米蔡',
    '306【鬓】米芾论书疑问多(一)',
    '307【瞿】米芾论书疑问多(二)',
    '308【仓】书家说梦',
    '309【卷】一个不可轻信的故事',
    '310【绳】且把金针度与人（一）掘墓',
    '311【司】且把金针度与人(二)疑点',
    '312【妻】且把金针度与人(三)笔论',
    '313【面】且把金针度与人(四)九势',
    '314【铁】文人的清狂',
    '315【暖】文人的谦虚(一)',
    '316【爵】文人的谦虚(二)',
    '317【赢】崇拜的得失(一)自述',
    '318【烟】崇拜的得失(二)吴玉如',
    '319【次】书林大隐道周公(一)闻名',
    '320【留】书林大隐道周公(二)拜谒',
    '321【眼】书林大隐道周公(三)拜读',
    '322【秀】年龄与书龄',
    '323【摇】笔墨情深何寂寥(一)',
    '324【驰】笔墨情深何寂寥(二)自强',
    '325【业】书法教学中遇到的几点困惑',
    '326【范】纸墨相发的解读',
    '327【英】纸墨相发的演示',
    '328【务】书法与美女',
    '329【般】说起胡长青',
    '330【渊】湖南书协润格表说明了什么',
    '331【乾】书家相重莫相轻',
    '332【修】学习碑帖应注意的两种倾向',
    '333【少】从心所欲不愈矩',
    '334【餐】民主与权威',
    '335【称】再谈落款常识(一)',
    '336【泥】再谈落款常识(二)',
    '337【还】浅谈诗词格律(一)',
    '338【某】浅谈诗词格律(二)',
    '339【爽】浅谈诗词格律(三)辙韵',
    '340【始】浅谈诗词格律(四)对偶',
    '341【金】浅谈诗词格律(五)孤平与失粘',
    '342【斜】浅谈诗词的艺术性(一)',
    '343【钓】浅谈诗词的艺术性(二)',
    '344【救】诗词与书法的共性',
    '345【旁】穷诗富字',
    '346【菊】使用书法字典应注意的问题',
    '347【兰】今楷是无知者的恶搞',
    '348【梅】今楷与行楷',
    '349【商】新闻调整现行汉字有感',
    '350【分】书法作品为何不用标点符',
    '351【泉】寄语青年书法爱好者',
    '352【飘】兄弟合写(一)相知',
    '353【边】兄弟合写(二)楷书',
    '354【焉】兄弟合写(三)行草书',
    '355【礴】王羲之的书法贡献(一)',
    '356【检】王羲之的书法贡献(二)',
    '357【鸡】张旭 怀素 王铎',
    '358【猎】书体 风格 水平',
    '359【本】台湾书法近况',
    '360【美】楷书欧阳莫学田',
    '361【羲】王铎其书其论(一)',
    '362【农】王铎其书其论(二)',
    '363【辱】赵朴初其人其书',
    '364【睦】李若禅藏帖中有赝品',
    '365【齾】结束语'
]
const traditionChars = '永火必右有無飛耳之乎者也哉不方為豈君臣日月雨竹魚馬龍風鳥山心其虎氣良能而處門安孝自高武每壽東西南北中多世此曾年史事是寺言登知家寒雲當筆張笑第築細終孫學即部德賦澤難道讀觀明愛得義獨橋頭集鬼故夜疾福醉花器各青矣相今思於臺憐流交國鄉亭物真品冠衣所萬新舊野如前後迅滔島琴然竟華興定我陽出要寶善惡書微老聲谷差章添州掘麗非啟勞皆激府歲將區桃叔態雙齊題起初對春夏秋敬光若以哀會喜戲驚樓貌恐驥鄙成幾殤黃翠許典寫寧動兼藏上下確錢音變齒漢翁聖繼念昌歸解教輕須既族郎廬盈博覺徐柳慮陰草敢曺切改紫色兆建唐貴作盡飲棄職肅墨壺樂魄足滿墳審帶辰祭窗神承天斷看居常四和鵬孟繁民佛賢堯報眾最院從謝希到何空夢延扁吾詹好快李頓壇急衛慶幽景侖密感謂龜鬢瞿倉卷繩司妻面鐵暖爵贏煙次留眼秀搖馳業範英務般淵乾修少餐稱泥還某爽始金斜釣救旁菊蘭梅商分泉飄邊焉礴檢雞獵本美羲農辱睦齾'
const state = reactive(
    {
        list_btn: "列表",
        single_class: "",
        single_show: '繁/全',
        show_alert: false,
        query: "",
        selected: "",
        everyDay: everyDayOrigin
    }
);


function switchSingleList() {
    if (state.list_btn == '列表') {
        state.everyDay = traditionChars.split('')
        state.list_btn = '单字'
        state.single_class = 'single-char'
    } else {
        state.everyDay = everyDayOrigin
        state.list_btn = '列表'
        state.single_class = ''
    }
}

function doSearch(query) {
    let filteredList = [] // 根据搜索条件过滤后的列表

    if (query != '') {
        everyDayOrigin.forEach(item => {
            if (item.indexOf(query) != -1) {
                filteredList.push(item)
            }
        })
    } else {
        if (state.everyDay.length != everyDayOrigin.length) {

            nextTick(() => {
                // 访问更新后的 DOM
                state.everyDay = everyDayOrigin
            })
        }
    }

    if (filteredList.length === 0) {
        state.show_alert = true
        setTimeout(() => {
            state.show_alert = false
        }, 3000)

    } else {
        if (state.list_btn == '单字') {
            state.single_class = ''
            state.list_btn = '列表'
        } 
        state.everyDay = filteredList
    }


}

/**
 * 过滤简体单字
 * 
 * return 过滤后的汉字 string
*/
function filterSingle() {
    let simpleChar = '';
    everyDayOrigin.forEach(item => simpleChar += item.charAt(4))
    return simpleChar
}
/**
 * 转换 简/繁
 * 全/同/异
 * 
 * return 转换后的string
 */
function switchSingleShow() {
    let tradiDiff = ''
    let simpDiff = ''
    let same = ''
    let i = 0;
    const simpChars = filterSingle()
    simpChars.split('').forEach(c => {
        const tradiChar = traditionChars.charAt(i)
        i++
        if (c != tradiChar) {
            tradiDiff += tradiChar
            simpDiff += c
        } else {
            same += c
        }
    })

    switch (state.single_show) {
        case '繁/全':
            state.everyDay = traditionChars
            break;
        case '繁/异':
            state.everyDay = tradiDiff
            break;
        case '简/全':
            state.everyDay = simpChars
            break;
        case '简/异':
            state.everyDay = simpDiff
            break;
        case '简/同':
            state.everyDay = same
            break;

        default:
            state.everyDay = traditionChars
    }
}
</script>
<style scoped>
.alert {
    color: red;
}

ul {
    text-align: left;
    padding-left: 15px;
    max-width: 420px;
}

li {
    list-style: none;
}

.single-char {
    display: inline-block;
    letter-spacing: 9px;
    line-height: 1.5;
}
</style>